content/posts/sheldon.md
+++
title = "Our First Foster Cat, Sheldon"
author = ["Dr Ian Hocking"]
date = 0121-01-12T00:00:00-00:01
lastmod = 2023-01-08T09:32:25+00:00
tags = ["cats"]
draft = false
+++

I wrote the below in the late spring of 2021.


## Small Packages {#small-packages}

My wife, Britta, went to bed a few minutes before me, calling down, 'Good night!' as I was locking the front door. Just before I called back, I thought I heard a stranger say, 'Good night.'

I called, 'What did you say?'

'Nothing---did you say something?'

Naturally, I went to bed thinking that there was a person in our house---friendly enough, it seemed---wishing us both a good night.

It had been six days since Sheldon died.


## You Too Will Die {#you-too-will-die}

I have a wireless router on the other side of the bedroom whose top light sometimes keeps me awake, so I've covered it with the most opaque thing I have to hand: a large, one-off coin with a skull emblem and a Latin tag reading 'Memento mori': remember, death. Despite this, the router still puts out a diffuse glow, and that glow went from blue to purple at some point yesterday night. Half awake, I felt sure I was drifting on a dark sea, rafted and cold, and this purple light came from the window of a clifftop house a mile or so to leeward, somewhere I might call home, or called to me as home. I still had half a notion that there was someone in our house. I got out of bed---my dream bed, that is, since I was still fast asleep---and opened the door.

Although the hallway has an automatic light, it hadn't turned on. I could see the jade eyes of a charcoal-grey cat looking at me from the darkness, just as they'd looked at me from the darkness of the curtained shelving in the spare room, those first few days. It was Sheldon. He recognised me, but wasn't relaxed; he retained the nervousness that overcame him when noticing me or Britta.

Was I pleased to see him? Are we ever pleased to see the dead? Sometimes, in dreams, I will meet and hug a long-passed relative---someone I barely touched while alive---and ask them how they're doing and where they've been and what they've seen. I'll tell them I'm married now, and that they've missed other births and deaths. But there is always a glow of awkwardness. I am alive and they are not. Will they resent me? But they often act wiser and happier than before. In the dream, I will put this wisdom down to the experience of death itself.

Relaxing his wise eyes, Sheldon turned in that way he had of turning when I approached with his  breakfast. In this way we went up the stairs, as we had many times before, to my office, which had been his world with us. But the scene up there was more like the belfry of an village church. My first thought was, _Blimey, Britta's been storing stuff up here. Leaving equipment and bric-a-brac._ There were opened plastic boxes filled with old calendars, shoes, rope, you name it; and I saw everything through a kind of dim, dusty fug. The floor was busy with cats. At least five or six, all of different kinds and all unfamiliar. They rubbed themselves against my legs and looked hopefully from their empty food bowls to me.

Of Sheldon there was no sign. I didn't call out to him or look for him. I knew he'd gone. He'd led me up here, and it was only when I woke in the morning that I realised he was telling me that there were other cats to take care of, that I shouldn't stop.


## Memento Sheldon {#memento-sheldon}

After breakfast he would wander into the centre of my office and lie on his side, staring into space like a poet. It was not done to touch him. If I broke this rule, he would labour to his feet and move to a spot out of arm's reach, and settle once more.

I would often turn to look at him for seconds at a time, thinking to myself: _Ian, this is odd behaviour. You're staring._ But cats are themselves a collection of odd behaviours, so I figured I would keep doing it, and Sheldon didn't mind. Just looking at him made me happy.

When we recycle things, or throw things away, Britta and I like to say 'Thanks'. It helps. I tried to say thanks to Sheldon but it wasn't in my power to do so. I settled for putting my fingers into his cage. He stilled briefly at my touch, but only briefly.

He meowed only once or twice in the time we knew him. Otherwise, he remained silent. A knock at the front door early in his stay triggered a kind of muffled wail that warbled as he jogged back to the darkness behind the shelves of the spare room. It was like when you're a kid and your friend punches you in the back and your voice deflects around like a Dalek. We wondered what associations he had.

He went to the vet twice. On the first occasion, he went limp like a trained civic protester before I could pick him up. Then, with me suspending him over the carrier, he sprang into a surprisingly effective starfish shape that almost prevented him going in. When he came back that night, I expected him to bear a grudge, or at least be grumpy, but he seemed delighted to see us and tolerated an unusual amount of physical contact. On the second occasion, when he had half an hour to live, he went in easily, trustfully.

He didn't poo for three days. When he did, were texting our friends like he was a furry child winning an egg-and-spoon race.

It took a week with us before his tail, tapping the ground impatiently like an old man's cane while waiting for a bus, stilled, and then slowly rose to the vertical as he mooched about.

He purred slowly when observed, clicking like a Geiger counter, the radioactivity increasing with our proximity, or our gaze, or just the faraway sound of Britta closing a kitchen drawer.

Breathing was hard for him. He had to concentrate on it.

I put everything in the front and took care of everything that came out the back.

I didn't really understand him. It was three days before I Googled 'Why is my neutered cat trying to have sex with my arm?' but it didn't make things clearer.

When it rained he would look at the window and frown, if cats frown.

When it was sunny, he lay in the sunlight and his charcoal fur yellowed and aged, and he was too hot to sleep, but didn't move.

We took pictures for his future owners. I'll hang the best one on the wall of the spare room.
